package 집합;

public class 집합 {
    public static void main(String[] args) {
        //집합의 종류와 연산
        //개별적인 개체들의 모임을 집합이라하며
        //집합을 이루는 개체를 원소라한다
        //집합은 대개 영어 대문자 원소는 영어 소문자로 표시한다.
        //집합을 이루는 원소들은 중괄후({})안에 나타내며 두가지방법 즉 원소나열법과
        //조건제시법으로 표시한다.

        //원소나열법
        //집합의 속한원소들을 일일히 나열하는방법

        //A = {1,5,7,3,9} 원소의 순서는 상관없지만 같은원소를 중복해선안된다
        //Hashset과같은??

        //의미가 분명할때는 일부원소를 생략하고 줄임표로 대체할수있다ㅣ
        //2에서 100까지의 짝수가 모인 집합
        //B = {2,4,6 ... 100}
        
    }
}
